Gets the boundary of current subregion.
  Namespace:   Autodesk.Revit.DB.Architecture
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public IList<CurveLoop> GetBoundary()
  Visual Basic
Public Function GetBoundary As IList(Of CurveLoop)
  Visual C++
public:
IList<CurveLoop^>^ GetBoundary()
 Return Value
 The curve loops that represent the boundary.
 See Also
  SiteSubRegion Class
  Autodesk.Revit.DB.Architecture Namespace